USER_MESSAGES = {
    'login': 'Вы залогинены',
    'logout': 'Вы разлогинены',
    'create': 'Пользователь успешно зарегистрирован',
    'update': 'Пользователь успешно изменен',
    'delete': 'Пользователь успешно удален',
    'delete_error': 'Невозможно удалить пользователя, потому что он используется',
    'permission_error': 'У вас нет прав для изменения другого пользователя.',
    'username_error': 'Такого пользователя не существует',
    'password_error': 'Исправьте пароль',
    'general_error': 'Ошибка: проверьте введенные данные',
}

TASK_MESSAGES = {
    'create': 'Задача успешно создана',
    'update': 'Задача успешно изменена',
    'delete': 'Задача успешно удалена',
    'delete_error': 'Задачу может удалить только ее автор',
    'create_error': 'Ошибка при создании задачи',
}

STATUS_MESSAGES = {
    'create': 'Статус успешно создан',
    'create_error': 'Ошибка при создании статуса',
    'update': 'Статус успешно изменен',
    'delete': 'Статус успешно удален',
    'delete_error': 'Невозможно удалить статус, потому что он используется',
}

LABEL_MESSAGES = {
    'create': 'Метка успешно создана',
    'create_error': 'Ошибка при создании метки',
    'update': 'Метка успешно изменена',
    'delete': 'Метка успешно удалена',
    'delete_error': 'Невозможно удалить метку, потому что она используется',
}